"""
Problem Name: George and Accommodation
Platform: Codeforces (467A)
Problem Link: https://codeforces.com/problemset/problem/467/A

Description:
জর্জ এবং তার বন্ধু অ্যালেক্স বিশ্ববিদ্যালয়ে নতুন ডরমিটরিতে (হলে) একটি রুম খুঁজছে। 
তাদের ডরমিটরিতে মোট n-সংখ্যক রুম আছে। 
প্রতিটি রুমে বর্তমানে কয়জন বাস করছে (p) এবং সর্বোচ্চ কয়জন থাকতে পারে (q) তা দেওয়া আছে।

যেহেতু জর্জ আর অ্যালেক্স দুজনে একসাথে থাকবে, তাই তাদের এমন একটি রুম দরকার 
যেখানে অন্তত ২টি ফাঁকা সিট আছে (অর্থাৎ q - p >= 2)।

ইনপুট:
- ১ম লাইনে মোট রুমের সংখ্যা (n)।
- পরবর্তী n-টি লাইনে ২টি করে সংখ্যা: p (বর্তমান মানুষ) এবং q (সর্বোচ্চ ধারণক্ষমতা)।

আউটপুট:
- তারা মোট কয়টি রুমে একসাথে উঠতে পারবে, সেই সংখ্যাটি প্রিন্ট করতে হবে।
"""


room = int(input())
countroom = 0

for i in range(room):
    p, q = map(int, input().split())
    
    
    if q - p >= 2:
        countroom += 1

print(countroom)
